In [3]:
import pandas as pd
d=pd.read_excel(r'C:\Users\user\Desktop\missing.xlsx')
df=pd.DataFrame(d)
print(df)

       Name  English  Maths  Science  Total
0     Honey     95.0    NaN     94.0    189
1     Dolly      NaN   99.0     96.0    195
2       TSR     60.0    NaN     70.0    130
3  Chinnari     65.0   55.0      NaN    120
4    Aadhya     88.0   94.0     99.0    281
5   Gulshan     92.0   95.0     95.0    282
6    Sowmya     80.0   60.0     90.0    230
7   Deepthi     80.0   70.0     85.0    235
8     Arjun     90.0   90.0     90.0    270
9    Shanvi     98.0   97.0     96.0    291

In [4]:
df.dropna()

      Name  English  Maths  Science  Total
4   Aadhya     88.0   94.0     99.0    281
5  Gulshan     92.0   95.0     95.0    282
6   Sowmya     80.0   60.0     90.0    230
7  Deepthi     80.0   70.0     85.0    235
8    Arjun     90.0   90.0     90.0    270
9   Shanvi     98.0   97.0     96.0    291

In [5]:
import pandas as pd
d=pd.read_excel(r'C:\Users\user\Desktop\missing.xlsx')
df=pd.DataFrame(d)
print(df)

       Name  English  Maths  Science  Total
0     Honey     95.0    NaN     94.0    189
1     Dolly      NaN   99.0     96.0    195
2       TSR     60.0    NaN     70.0    130
3  Chinnari     65.0   55.0      NaN    120
4    Aadhya     88.0   94.0     99.0    281
5   Gulshan     92.0   95.0     95.0    282
6    Sowmya     80.0   60.0     90.0    230
7   Deepthi     80.0   70.0     85.0    235
8     Arjun     90.0   90.0     90.0    270
9    Shanvi     98.0   97.0     96.0    291

In [6]:
df['Name'].dropna()

0       Honey
1       Dolly
2         TSR
3    Chinnari
4      Aadhya
5     Gulshan
6      Sowmya
7     Deepthi
8       Arjun
9      Shanvi
Name: Name, dtype: object

In [7]:
import pandas as pd
d=pd.read_excel(r'C:\Users\user\Desktop\missing.xlsx')
df=pd.DataFrame(d)
print(df)

       Name  English  Maths  Science  Total
0     Honey     95.0    NaN     94.0    189
1     Dolly      NaN   99.0     96.0    195
2       TSR     60.0    NaN     70.0    130
3  Chinnari     65.0   55.0      NaN    120
4    Aadhya     88.0   94.0     99.0    281
5   Gulshan     92.0   95.0     95.0    282
6    Sowmya     80.0   60.0     90.0    230
7   Deepthi     80.0   70.0     85.0    235
8     Arjun     90.0   90.0     90.0    270
9    Shanvi     98.0   97.0     96.0    291

In [8]:
df.loc[:,['Name','English']].dropna()

       Name  English
0     Honey     95.0
2       TSR     60.0
3  Chinnari     65.0
4    Aadhya     88.0
5   Gulshan     92.0
6    Sowmya     80.0
7   Deepthi     80.0
8     Arjun     90.0
9    Shanvi     98.0

In [9]:
import pandas as pd
d=pd.read_excel(r'C:\Users\user\Desktop\missing.xlsx')
df=pd.DataFrame(d)
print(df)

       Name  English  Maths  Science  Total
0     Honey     95.0    NaN     94.0    189
1     Dolly      NaN   99.0     96.0    195
2       TSR     60.0    NaN     70.0    130
3  Chinnari     65.0   55.0      NaN    120
4    Aadhya     88.0   94.0     99.0    281
5   Gulshan     92.0   95.0     95.0    282
6    Sowmya     80.0   60.0     90.0    230
7   Deepthi     80.0   70.0     85.0    235
8     Arjun     90.0   90.0     90.0    270
9    Shanvi     98.0   97.0     96.0    291

In [10]:
df.fillna("*")

       Name English Maths Science  Total
0     Honey      95     *      94    189
1     Dolly       *    99      96    195
2       TSR      60     *      70    130
3  Chinnari      65    55       *    120
4    Aadhya      88    94      99    281
5   Gulshan      92    95      95    282
6    Sowmya      80    60      90    230
7   Deepthi      80    70      85    235
8     Arjun      90    90      90    270
9    Shanvi      98    97      96    291

In [11]:
df['English'].fillna(33)

0    95.0
1    33.0
2    60.0
3    65.0
4    88.0
5    92.0
6    80.0
7    80.0
8    90.0
9    98.0
Name: English, dtype: float64